app/Controllers/Alu.php

    public function form(): string
    {
        $db = \Config\Database::connect();
        $pt = $db->table('professores')->select('nome, id')->where('materia', 'portugues')->get()->getResult();
        $cc = $db->table('professores')->select('nome, id')->where('materia', 'ciencias')->get()->getResult();
        $mt = $db->table('professores')->select('nome, id')->where('materia', 'matematica')->get()->getResult();
---
SELECT `nome`, `id`
FROM `professores`
WHERE `materia` = 'portugues'
SELECT `nome`, `id`
FROM `professores`
WHERE `materia` = 'ciencias'
SELECT `nome`, `id`
FROM `professores`
WHERE `materia` = 'matematica'

    public function acompanhar(): string
    {
        $db = \Config\Database::connect();
        $cod = $_POST['codigo'];
        $dados = $db->table('postagem')->select('mensagem, resposta')->where('cod', $cod)->get()->getRow();
---
SELECT `mensagem`, `resposta`
FROM `postagem`
WHERE `cod` = ''