app/Controllers/Pro.php

SELECT *
FROM `professores`
WHERE `login` = 'prof'
AND `password` = 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3'
SELECT *
FROM `postagem`
WHERE `professor_id` = '1'
AND `status` = 'pendente'
SELECT *
FROM `postagem`
WHERE `professor_id` = '1'
AND `status` = 'respondido'
---
    public function index(): string
    {
        $db = \Config\Database::connect();
        $conect = $db->table('professores')->where('login', Session()->get('PLogin'))->where('password', Session()->get('PPassword'))->get()->getRow();
        if($conect){
            $pendentes = $db->table('postagem')->where('professor_id', $conect->id)->where('status', 'pendente')->get()->getResult();
            $npendentes = $db->table('postagem')->where('professor_id', $conect->id)->where('status', 'respondido')->get()->getResult();

SELECT *
FROM `professores`
WHERE `login` = 'prof'
AND `password` = 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3'
UPDATE `postagem` SET `resposta` = 'eaeeee', `status` = 'respondido'
WHERE `id` = '1'
---
    public function resposta(): string
    {
        $db = \Config\Database::connect();
        $conect = $db->table('professores')->where('login', Session()->get('PLogin'))->where('password', Session()->get('PPassword'))->get()->getRow();
        if($conect){
            $id = $_POST['id'];
            $mensagem = $_POST['resposta'];
            $db->table('postagem')->where('id', $id)->update(['resposta' => $mensagem, 'status' => 'respondido']);

SELECT *
FROM `professores`
WHERE `login` = 'prof'
AND `password` = 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3'
UPDATE `postagem` SET `resposta` = NULL, `status` = 'pendente'
WHERE `id` = '1'
---
    public function rm(): string
    {
        $db = \Config\Database::connect();
        $conect = $db->table('professores')->where('login', Session()->get('PLogin'))->where('password', Session()->get('PPassword'))->get()->getRow();
        if($conect){
            $id = $_POST['id'];
            $db->table('postagem')->where('id', $id)->update(['resposta' => null, 'status' => 'pendente']);